Repository: Sopsy/Lauta1
Catalog: public/inc/i18n/*.UTF-8/LC_MESSAGES/default.po
Languages: fi_fi

source: Saving the message failed.
fi_fi: Viestin tallentaminen epäonnistui.

source: Please type in a login name
fi_fi: Kirjoita kirjautumisnimi

source: Your name is too long. Max allowed length is %s characters
fi_fi: Nimesi on liian pitkä. Suurin sallittu pituus in %s merkkiä

source: You are already logged in.
fi_fi: Olet jo kirjautuneena.

source: This name is already in use. Please choose another one.
fi_fi: Tämä nimi on jo käytössä. Valitse toinen.

source: Welcome to Ylilauta %s, This message confirms that this email address was added to your new account and can now be used for password recovery. We do not save your email address in a readable form. We can never see it or use it to contact you. We cannot even search user accounts by email addresses. It can only be used for password recovery purposes. Best regards, Ylilauta.org
fi_fi: Tervetuloa Ylilaudalle %s, Tämä viesti vahvistaa, että tämä sähköpostiosoite lisättiin uudelle tunnuksellesi ja sitä voidaan nyt käyttää salasanan palautukseen. Emme tallenna sähköpostiosoitettasi luettavassa muodossa. Emme koskaan voi nähdä sitä tai käyttää sitä ottaaksemme yhteyttä sinuun. Emme voi edes etsiä käyttäjätunnuksia sähköpostiosoitteella. Sitä voidaan käyttää ainoastaan salasanan palauttamiseen. Ystävällisin terveisin, Ylilauta.org

source: Welcome to Ylilauta
fi_fi: Tervetuloa Ylilaudalle

source: Please refresh this page and try again.
fi_fi: Päivitä tämä sivu ja yritä uudelleen.

source: Please give your current password
fi_fi: Anna nykyinen salasanasi

source: The internet connection you are using is commonly used for abuse, so reporting from it is not allowed.
fi_fi: Käyttämääsi internet-yhteyttä käytetään usein häiriköintiin, joten ilmiantaminen sillä ei ole sallittua.

source: You have to give a reason for your report.
fi_fi: Sinun täytyy antaa syy ilmiannollesi.

source: Reporting the message failed.
fi_fi: Viestin ilmiantaminen epäonnistui.

source: You have changed your username recently, so you can't do it again yet.
fi_fi: Olet vaihtanut käyttäjänimesi äskettäin, joten et vielä voi vaihtaa sitä uudelleen.

source: Hi %s, This message confirms that this email address was added to your account and can now be used for password recovery. We do not save your email address in a readable form. We can never see it or use it to contact you. We cannot even search user accounts by email addresses. It can only be used for password recovery purposes. Best regards, Ylilauta.org
fi_fi: Hei %s, Tämä viesti vahvistaa, että tämä sähköpostiosoite lisättiin tunnuksellesi ja sitä voidaan nyt käyttää salasanan palautukseen. Emme tallenna sähköpostiosoitettasi luettavassa muodossa. Emme koskaan voi nähdä sitä tai käyttää sitä ottaaksemme yhteyttä sinuun. Emme voi edes etsiä käyttäjätunnuksia sähköpostiosoitteella. Sitä voidaan käyttää ainoastaan salasanan palauttamiseen. Ystävällisin terveisin, Ylilauta.org

source: Email address added to account
fi_fi: Sähköpostiosoite lisätty tunnukseen

source: Permission denied.
fi_fi: Ei käyttöoikeutta.

source: Your message contained a blacklisted word (%s)
fi_fi: Viestisi sisälsi mustalistatun sanan (%s)

source: You cannot edit posts on a locked board.
fi_fi: Et voi muokata viestejä lukitulla laudalla.

source: Error saving preferences
fi_fi: Virhe tallentaessa asetuksia

source: Hi %s, Someone has requested an account recovery key using your username and email address. If this wasn't you, you can just ignore this email. Recovery key: %s The recovery key is valid for one hour. Best regards, Ylilauta.org
fi_fi: Hei %s, Joku pyysi salasanan palautusta käyttäen käyttäjänimeäsi ja sähköpostiosoitettasi. Jos se et ollut sinä, voit vain jättää tämän viestin huomiotta. Palautusavain: %s Palautusavain on voimassa yhden tunnin. Ystävällisin terveisin, Ylilauta.org

source: Ylilauta account recovery
fi_fi: Ylilaudan tunnuksen palauttaminen

source: Account locked
fi_fi: Tunnus lukittu

source: Account unlocked
fi_fi: Tunnus avattu

source: Antispam enabled
fi_fi: Roskapostin esto käytössä

source: Antispam disabled
fi_fi: Roskapostin esto poistettu käytöstä

source: Unknown command
fi_fi: Tuntematon komento

source: Tag
fi_fi: Tagi

source: This post has not been edited.
fi_fi: Tätä viestiä ei ole muokattu.

source: Old version at %s
fi_fi: Vanha versio, muokattu %s

source: , edited by %s
fi_fi: , muokkaaja %s

source: Choose the Gold account key you wish to donate to this user.
fi_fi: Valitse Kultatiliavain jonka tahdot lahjoittaa tälle käyttäjälle.

source: Selected post: %s
fi_fi: Valittu viesti: %s

source: You have no Gold account keys available to be donated.
fi_fi: Sinulla ei ole Kultatiliavaimia joita voi lahjoittaa.

source: Purchase Gold account keys
fi_fi: Osta Kultatiliavaimia

source: Donate
fi_fi: Lahjoita

source: Terms and conditions
fi_fi: Käyttöehdot

source: The donation may not reach the person who sent the message if they are not using the same user account anymore.
fi_fi: Lahjoitus ei välttämättä tavoita viestin kirjoittajaa, mikäli hän ei käytä enää samaa käyttäjätunnusta.

source: If the user account with which the message was sent with does not exist at all, the Gold account key is returned to your user account.
fi_fi: Jos viestin lähettänyttä käyttäjätunnusta ei ole enää olemassa, Kultatiliavain palautetaan tunnuksellesi.

source: Each individual Gold account key can only be donated once.
fi_fi: Jokaisen yksittäisen Kultatiliavaimen voi lahjoittaa vain kerran.

source: Other terms apply, please read the terms and conditions from the regular Gold account purchase page.
fi_fi: Muita ehtoja on voimassa, lue ehdot Kultatilin ostosivulta.

source: You agree to these terms by continuing.
fi_fi: Hyväksyt nämä ehdot jatkamalla.

source: Send recovery code
fi_fi: Lähetä palautusavain

source: If the email address was correct, we just sent you a recovery key. Please check your email for it.
fi_fi: Jos antamasi sähköpostiosoite oli oikein, lähetimme sinulle juuri palautusavaimen. Hae se sähköpostistasi.

source: Did not get it? Close this window and try again.
fi_fi: Etkö saanut sitä? Sulje tämä ikkuna ja yritä uudelleen.

source: Recovery key
fi_fi: Palautusavain

source: Confirm password
fi_fi: Salasanavahvistus

source: How is this post violating the rules?
fi_fi: Kuinka tämä viesti rikkoo sääntöä?

source: Please select
fi_fi: Valitse

source: Additional details
fi_fi: Lisätiedot

source: Optional
fi_fi: Valinnainen

source: You don't have any notifications.
fi_fi: Sinulla ei ole yhtään ilmoituksia.

source: Your post has a new reply
fi_fi: Viestissäsi on uusi vastaus

source: Your post has %s new replies
fi_fi: Viestissäsi on %s uutta vastausta

source: Your thread %s has a new reply
fi_fi: Langassasi %s on uusi vastaus

source: Your thread %s has %s new replies
fi_fi: Langassasi %s on %s uutta vastausta

source: Thread %s has a new reply
fi_fi: Langassa %s on uusi vastaus

source: Thread %s has %s new replies
fi_fi: Langassa %s on %s uutta vastausta

source: Your post has been upvoted!
fi_fi: Viestisi sai tää-äänen!

source: Your post has been upvoted %s times!
fi_fi: Viestisi on saanut %s tää-ääntä!

source: Someone just gave you a Gold account!
fi_fi: Joku lahjoitti sinulle juuri kultatilin!

source: Someone just gave you a Gold account for your post!
fi_fi: Joku lahjoitti sinulle juuri kultatilin viestistäsi!

source: You received %d Gold accounts for your post!
fi_fi: Sait %d kultatiliä viestistäsi!

source: Nothing to announce. Stupid admins forgot the message.
fi_fi: Ei mitään ilmoitettavaa. Tyhmät ylläpitäjät unohtivat viestin.

source: Announcement: %s
fi_fi: Ilmoitus: %s

source: This was a tag that does not exist anymore...
fi_fi: Tämä oli tagi, jota ei ole enää olemassa...

source: Weird, we don't even know which tag it was!
fi_fi: Kummallista, emme edes tiedä mikä tagi se oli!

source: You got a new tag: %s
fi_fi: Sait uuden tagin: %s

source: Automatic due to inactivity
fi_fi: Automaattinen inaktiivisuuden vuoksi

source: Deleted by the user who created the thread
fi_fi: Käyttäjä joka loi langan poisti sen

source: Deleted by a moderator
fi_fi: Moderaattorin poistama

source: Moderator deleted multiple posts from this user (e.g. because of spamming)
fi_fi: Moderaattori poisti useita viestejä tältä käyttäjältä (esim. roskapostituksen vuoksi)

source: Reason for deletion: %s
fi_fi: Poiston syy: %s
