Repository: Sopsy/Lauta1
Catalog: public/inc/i18n/*.UTF-8/LC_MESSAGES/default.po
Languages: fi_fi

source: Class
fi_fi: Luokka

source: Log rows (last month)
fi_fi: Logirivejä (viimeinen kuukausi)

source: (last 6 months)
fi_fi: (viimeiset 6 kuukautta)

source: Last active
fi_fi: Viimeksi aktiivisena

source: Admin
fi_fi: Ylläpitäjä

source: Super moderator
fi_fi: Supermoderaattori

source: Moderator
fi_fi: Moderaattori

source: Database error
fi_fi: Tietokantavirhe

source: Banned by
fi_fi: Bannaaja

source: Added
fi_fi: Lisätty

source: Ends
fi_fi: Päättyy

source: Reason
fi_fi: Syy

source: Actions
fi_fi: Toimenpiteet

source: Accept
fi_fi: Hyväksy

source: Reject
fi_fi: Hylkää

source: Appeal
fi_fi: Valitus

source: Post
fi_fi: Viesti

source: No unchecked ban appeals
fi_fi: Ei tarkistamattomia bannivalituksia

source: No announcements
fi_fi: Ei ilmoituksia

source: Message ID
fi_fi: Viestin ID

source: Delete file only
fi_fi: Poista vain tiedosto

source: Delete messages by the user
fi_fi: Poista viestit käyttäjältä

source: Interval in seconds (0 = all)
fi_fi: Aikaväli sekunneissa (0 = kaikki)

source: Delete multiple messages
fi_fi: Poista useita viestejä

source: Post does not exist
fi_fi: Viestiä ei ole olemassa

source: File deleted from message
fi_fi: Tiedosto poistettu viestistä

source: File deleted from %d messages
fi_fi: Tiedosto poistettu %d viestistä

source: Deleting the file failed
fi_fi: Tiedoston poistaminen epäonnistui

source: Message deleted
fi_fi: Viesti poistettu

source: %d messages deleted
fi_fi: %d viestiä poistettu

source: Deleting the message failed
fi_fi: Viestin poistaminen epäonnistui

source: Lock account
fi_fi: Lukitse tunnus

source: Unlock account
fi_fi: Avaa tunnus

source: Account created
fi_fi: Tunnus luotu

source: No
fi_fi: Ei

source: Yes
fi_fi: Kyllä

source: Delete ban
fi_fi: Poista banni

source: Invalid token
fi_fi: Virheellinen tarkiste

source: Ban deleted
fi_fi: Banni poistettu

source: Return
fi_fi: Palaa takaisin

source: All active bans
fi_fi: Kaikki aktiiviset bannit

source: Show expired bans
fi_fi: Näytä vanhentuneet bannit

source: Expired bans
fi_fi: Vanhentuneet bannit

source: Show active bans
fi_fi: Näytä aktiiviset bannit

source: Delete
fi_fi: Poista

source: Viewing the moderation log of %s
fi_fi: Näytetään käyttäjän %s moderointiloki

source: Show all
fi_fi: Näytä kaikki

source: Action
fi_fi: Toimenpide

source: Information
fi_fi: Tiedot

source: Timestamp
fi_fi: Aikaleima

source: IP-address
fi_fi: IP-osoite

source: Deleted a message
fi_fi: Poisti viestin

source: Banned an user
fi_fi: Bannasi käyttäjän

source: Sent a message as an admin
fi_fi: Lähetti viestin ylläpitäjänä

source: Invalid login
fi_fi: Virheellinen tunnus

source: Stickied a thread
fi_fi: Kiinnitti langan

source: Unstickied a thread
fi_fi: Poisti langan kiinnityksen

source: Locked a thread
fi_fi: Lukitsi langan

source: Unlocked a thread
fi_fi: Avasi langan

source: Deleted a thread
fi_fi: Poisti langan

source: Deleted a post
fi_fi: Poisti viestin

source: Deleted a file from a message
fi_fi: Poisti tiedoston viestistä

source: Changed blacklisted words
fi_fi: Vaihtoi mustalistattuja sanoja

source: Created a Gold account key
fi_fi: Loi Kultatiliavaimen

source: Moved a thread
fi_fi: Siirsi langan

source: Checked a report
fi_fi: Tarkisti ilmiannon

source: Marked all reports as checked
fi_fi: Merkitsi kaikki ilmiannot tarkistetuksi

source: Logged in
fi_fi: Kirjautuneena

source: Locked an user
fi_fi: Lukitsi käyttäjän

source: Unlocked an user
fi_fi: Avasi käyttäjän

source: Messages per month
fi_fi: Viestiä per kuukausi

source: Messages per day
fi_fi: Viestiä per päivä

source: Messages per hour
fi_fi: Viestiä per tunti

source: Total
fi_fi: Yhteensä

source: Bad request
fi_fi: Virheellinen pyyntö

source: Unauthorized
fi_fi: Pääsy evätty

source: Reported messages
fi_fi: Ilmiannetut viestit

source: Invalid IP-address
fi_fi: Virheellinen IP-osoite

source: All reports from ip cleared
fi_fi: Kaikki ilmoitukset IP:ltä poitettu

source: Action failed
fi_fi: Toimenpide epäonnistui

source: All reports from user cleared
fi_fi: Kaikki ilmiannot käyttäjältä poistettu

source: Uncleared reports
fi_fi: Tarkistamattomat ilmiannot

source: Show cleared reports
fi_fi: Näytä tarkistetut ilmiannot

source: Cleared reports
fi_fi: Tarkistetut ilmiannot

source: Show uncleared reports
fi_fi: Näytä tarkistamattomat ilmiannot

source: By IP
fi_fi: IP:n mukaan

source: By user
fi_fi: Käyttäjän mukaan

source: Reported
fi_fi: Ilmiannettu

source: Checked by
fi_fi: Tarkistaja

source: No reports
fi_fi: Ei ilmiantoja

source: Disable
fi_fi: Poista käytöstä

source: Enable
fi_fi: Ota käyttöön

source: Manage thread options
fi_fi: Hallitse langan tietoja

source: Thread locked
fi_fi: Lanka lukittu

source: Thread unlocked
fi_fi: Lanka avattu

source: Thread stickied
fi_fi: Lanka kiinnitetty

source: Thread unstickied
fi_fi: Langan kiinnitys poistettu

source: Thread moved
fi_fi: Lanka siirretty

source: Go to thread
fi_fi: Siirry lankaan

source: Go to board
fi_fi: Siirry laudalle

source: Thread ID
fi_fi: Langan ID

source: Lock or stick thread
fi_fi: Lukitse tai kiinnitä lanka

source: Lock
fi_fi: Lukitse

source: Unlock
fi_fi: Avaa

source: Stick
fi_fi: Kiinnitä

source: Unstick
fi_fi: Poista kiinnitys

source: Move to another board
fi_fi: Siirrä toiselle laudalle

source: Bump thread
fi_fi: Nosta lanka

source: Move
fi_fi: Siirrä

source: Reports
fi_fi: Ilmiannot

source: Insufficient permissions
fi_fi: Ei oikeuksia

source: %dh
fi_fi: %dt

source: %dd
fi_fi: %dpv

source: %dw
fi_fi: %dvk

source: %dm
fi_fi: %dkk

source: Choose
fi_fi: Valitse

source: Threads you have made
fi_fi: Luomasi langat

source: Total: %d threads
fi_fi: Yhteensä %d lankaa

source: Replies you have sent
fi_fi: Lähettämäsi vastaukset

source: Total: %d replies
fi_fi: Yhteensä %d vastausta

source: Posts you have upvoted
fi_fi: Viestit, joille olet antanut tää-äänen

source: Total: %d posts
fi_fi: Yhteensä %d viestiä

source: Delete data
fi_fi: Poista tietoja

source: Delete all threads I have made
fi_fi: Poista kaikki luomani langat

source: Delete all thread replies I have sent (excluding your own threads)
fi_fi: Poista kaikki lähettämäni vastaukset lankoihin (lukuunottamatta omia lankoja)

source: Delete all upvotes I have given
fi_fi: Poista kaikki antamani tää-äänet

source: Site preferences
fi_fi: Sivuston asetukset

source: User profile
fi_fi: Käyttäjäprofiili

source: Active logins
fi_fi: Aktiiviset kirjautumiset

source: General preferences
fi_fi: Yleiset asetukset

source: Hide image thumbnails
fi_fi: Piilota esikatselukuvat

source: Notifications and subscribed threads
fi_fi: Ilmoitukset ja seuratut langat

source: Automatically subscribe to all threads I create
fi_fi: Seuraa automaattisesti luomiani lankoja

source: Automatically subscribe to all threads I reply to
fi_fi: Seuraa automaattisesti lankoja, joihin vastaan

source: Notify me about new replies to my threads
fi_fi: Ilmoita minulle uusista vastauksista lankoihini

source: Notify me about new replies to threads I am subscribed to
fi_fi: Ilmoita minulle uusista vastauksista seuraamiini lankoihin

source: Notify me about new replies to my posts
fi_fi: Ilmoita minulle uusista vastauksista viesteihini

source: Notify me about upvotes to my posts
fi_fi: Ilmoita minulle tää-äänistä viesteihini

source: Show floating followed threads -box
fi_fi: Näytä kelluva seuratut langat -laatikko

source: Order of followed threads
fi_fi: Seurattujen lankojen järjestys

source: Threads with most unread replies first
fi_fi: Ensin langat, joissa on eniten lukemattomia vastauksia

source: Threads with latest replies first
fi_fi: Ensin langat, joissa on uusimmat vastaukset

source: To activate these functions, you need to have a Ylilauta Gold account.
fi_fi: Aktivoidaksesi nämä toiminnot tarvitset Ylilaudan Kultatilin.

source: Remove advertisements and analytics
fi_fi: Poista mainokset ja tilastointi

source: Hide all posts from these users (one per row)
fi_fi: Piilota kaikki viestit näiltä käyttäjiltä (yksi riviä kohden)

source: Custom CSS
fi_fi: Omat CSS-määritykset

source: Display text input
fi_fi: Näytä tekstikenttä

source: If you accidentally do something stupid with this field, just open <b>%s</b> to restore the defaults.
fi_fi: Jos teet vahingossa jotain tyhmää tämän kentän kanssa, voit palauttaa oletukset avaamalla <b>%s</b>.

source: Display language
fi_fi: Näyttökieli

source: Layout and appearance
fi_fi: Teema ja ulkonäkö

source: Stylesheet
fi_fi: Tyylitiedosto

source: Threads per board page
fi_fi: Lankoja per lautasivu

source: Posts per thread on board page
fi_fi: Viestejä per lanka lautasivulla

source: Save changes to preferences
fi_fi: Tallenna muutokset asetuksiin

source: Hiding of boards
fi_fi: Lautojen piilottaminen

source: Select the boards to be hidden from board listings and from pages that show threads from multiple boards.
fi_fi: Valitse laudat jotka haluat piilottaa lautaluetteloista ja sivuilta, jotka näyttävät lankoja useammilta laudoilta.

source: The percentage after the board name tells you how many users have hidden that particular board.
fi_fi: Prosenttimäärä laudan nimen perässä kertoo kuinka moni käyttäjä on piilottanut kyseisen laudan.

source: Toggle all
fi_fi: Vaihda kaikki

source: Trivia
fi_fi: Nippelitietoa

source: User ID
fi_fi: Käyttäjän ID

source: Started threads
fi_fi: Aloitettuja lankoja

source: Sent messages
fi_fi: Lähetettyjä viestejä

source: Total pageloads
fi_fi: Sivulatauksia yhteensä

source: Total characters in messages
fi_fi: Merkkejä viesteissä yhteensä

source: Average message length
fi_fi: Viestien keskim. pituus

source: characters
fi_fi: merkkiä

source: Epic threads
fi_fi: Eeppisiä lankoja

source: Threads hidden
fi_fi: Piilotettuja lankoja

source: Threads followed
fi_fi: Seurattuja lankoja

source: Uploaded files
fi_fi: Lähetettyjä tiedostoja

source: Total uploaded data
fi_fi: Lähetettyä dataa yhteensä

source: Upboats given
fi_fi: Tää-ääniä annettu

source: Upboats received
fi_fi: Tää-ääniä vastaanotettu

source: Gold accounts donated
fi_fi: Kultatilejä lahjoitettu

source: Gold account donations received
fi_fi: Kultatililahjoituksia saatu

source: View a list of my posts
fi_fi: Näytä luettelo viesteistäni

source: User account
fi_fi: Käyttäjätunnus

source: Change
fi_fi: Vaihda

source: Email
fi_fi: Sähköposti

source: Your email address is only used for account recovery. We can not see it or use it to contact you.
fi_fi: Sähköpostiosoitettasi käytetään vain tunnuksen palauttamiseen. Me emme voi nähdä sitä tai ottaa sinuun yhteyttä sen avulla.

source: Current password
fi_fi: Nykyinen salasana

source: Change password
fi_fi: Vaihda salasana

source: New password
fi_fi: Uusi salasana

source: Delete user account
fi_fi: Poista käyttäjätunnus

source: Deleting your user account permanently removes all your site preferences, statistics and other account related data.
fi_fi: Käyttäjätunnuksesi poistaminen poistaa pysyvästi kaikki asetuksesi, tilastosi ja muut tunnukseen liittyvän datan.

source: Deleting your user account also removes any Gold account time you have left. It cannot be restored afterwards!
fi_fi: Tunnuksesi poistaminen poistaa myös kaiken jäljellä olevan Kultatiliaikasi. Sitä ei voida palauttaa jälkikäteen!

source: As you have not registered, your user account will be deleted automatically after a few days of inactivity.
fi_fi: Koska et ole rekisteröitynyt, käyttäjätunnuksesi poistetaan automaattisesti mikäli et vieraile Ylilaudalla muutamaan päivään.

source: Yes, I want to permanently delete my user account
fi_fi: Kyllä, haluan poistaa käyttäjätunnukseni pysyvästi

source: Also delete all posts I have sent
fi_fi: Poista myös kaikki lähettämäni viestit

source: Delete account
fi_fi: Poista tunnus

source: You don't have a Gold account
fi_fi: Sinulla ei ole Kultatiliä

source: You have a Gold account
fi_fi: Sinulla on Kultatili

source: You risk losing your Gold account because you have not created an user account. Please create an account to make sure it does not suddenly disappear.
fi_fi: Saatat menettää Kultatilisi, koska et ole luonut käyttäjätunnusta. Luo tunnus varmistaaksesi, ettei kultatilisi yllättäen katoa.

source: Your Gold account expires %s.
fi_fi: Kultatilisi voimassaoloaika päättyy %s.

source: Activate Gold account
fi_fi: Aktivoi Kultatili

source: Gold account key
fi_fi: Kultatiliavain

source: Activate
fi_fi: Aktivoi

source: Your Gold account duration will be extended with the length of the key.
fi_fi: Jos sinulla on jo Kultatili, sen kestoa jatketaan Kultatiliavaimen pituuden verran.

source: Purchase a Gold account
fi_fi: Osta Kultatili

source: Your user account has unused gold keys
fi_fi: Käyttäjätunnuksellasi on käyttämättömiä kultatiliavaimia

source: Length: %s
fi_fi: Pituus: %s

source: Expires: %s
fi_fi: Vanhenee: %s

source: Donatable: %s
fi_fi: Lahjoitettavissa: %s

source: These tags are no longer obtainable
fi_fi: Näitä tageja ei voi enää saada

source: Login time
fi_fi: Kirjautumisaika

source: Last activity
fi_fi: Viimeksi aktiivisena

source: Current session
fi_fi: Nykyinen istunto

source: Log out from other places
fi_fi: Kirjaudu ulos muualta

source: Password reset
fi_fi: Salasanan nollaus

source: You can reset a forgotten password with this form.
fi_fi: Voit nollata unohtuneen salasanan tällä lomakkeella.

source: To make sure, the reset is not going for a wrong account, you are required to input the login name and UID of the account.
fi_fi: Jotta voit olla varma, ettei nollaus mene väärälle tunnukselle, sinun täytyy syöttää tunnuksen kirjautumisnimi ja UID.

source: Login name
fi_fi: Kirjautumisnimi

source: Password changed
fi_fi: Salasana vaihdettu

source: New password for user %s is %s
fi_fi: Uusi salasana tunnukselle %s on %s

source: Password not changed!
fi_fi: Salasanaa ei vaihdettu!

source: User not found or invalid UID
fi_fi: Tunnusta ei löydy tai virheellinen UID

source: Your session has expired. Please refresh the page and try again.
fi_fi: Istuntosi on vanhentunut. Päivitä sivu ja yritä uudelleen.

source: You don't have have enough activity to upvote
fi_fi: Sinulla ei ole tarpeeksi aktiivisuutta tää-äänien antamiseen

source: Message does not exist
fi_fi: Viestiä ei ole olemassa

source: You cannot upvote your own posts
fi_fi: Et voi antaa omille viesteillesi Tää :D

source: You have already upvoted this post
fi_fi: Olet jo antanut tälle viestille Tää :D

source: Your password needs to be at least six characters long
fi_fi: Salasanasi täytyy olla ainakin kuusi merkkiä pitkä

source: New passwords do not match
fi_fi: Uudet salasanat eivät täsmää

source: Wrong current password
fi_fi: Nykyinen salasana on väärin

source: Your browser did not send us a Google reCAPTCHA response. Check that you are not blocking it. Please refresh this page and try again.
fi_fi: Selaimesi ei lähettänyt Google reCAPTCHA -vastausta. Tarkista, ettet estä sitä. Päivitä tämä sivu ja yritä uudelleen.

source: Google reCAPTCHA thinks you are a robot. Please refresh this page and try again.
fi_fi: Google reCAPTCHA ajattelee sinun olevan robotti. Päivitä tämä sivu ja yritä uudelleen.

source: Account recovery information was incorrect
fi_fi: Tunnuksen palautustiedot olivat virheelliset

source: Allowed characters are: a-Ö 0-9 _ -
fi_fi: Sallitut merkit ovat: a-Ö 0-9 _ -

source: Too long - max allowed length is %s characters
fi_fi: Liian pitkä - suurin sallittu pituus on %s merkkiä

source: Already in use
fi_fi: On jo käytössä

source: You can only delete your own messages.
fi_fi: Voit poistaa vain omia viestejäsi.

source: Deleting the message failed.
fi_fi: Viestin poistaminen epäonnistui.

source: Invalid password
fi_fi: Virheellinen salasana

source: Deleting your threads failed!
fi_fi: Lankojen poistaminen epäonnistui!

source: Deleting your replies failed!
fi_fi: Vastauksien poistaminen epäonnistui!

source: Deleting your upvotes failed!
fi_fi: Tää-äänien poistaminen epäonnistui!

source: You did not confirm the deletion of your profile. No actions taken.
fi_fi: Et vahvistanut profiilisi poistoa. Profiilia ei poistettu.

source: Unexpected error
fi_fi: Odottamaton virhe

source: Your user account was deleted successfully, but an error occurred while trying to delete your posts. Please contact us to continue with the deletion of your posts.
fi_fi: Käyttäjätunnuksesi poistettiin onnistuneesti, mutta viestien poistamisessa tapahtui virhe. Otathan meihin yhteyttä jatkaaksesi viestiesi poistamista.

source: Thread does not exist
fi_fi: Lankaa ei ole olemassa

source: You cannot delete this thread now because it's still active.
fi_fi: Et voi poistaa tätä lankaa nyt, koska se on edelleen aktiivinen.

source: Deleting the thread failed.
fi_fi: Langan poistaminen epäonnistui.

source: The user account this post was made with does not exist anymore...
fi_fi: Käyttäjätunnusta jolla tämä viesti on lähetetty, ei enää ole olemassa...

source: You cannot donate Gold account keys to yourself.
fi_fi: Et voi lahjoittaa Kultatiliavaimia itsellesi.

source: This Gold account key has already been donated!
fi_fi: Tämä Kultatiliavain on jo lahjoitettu!

source: Invalid post
fi_fi: Virheellinen viesti

source: This file is being processed...
fi_fi: Tätä tiedostoa käsitellään...

source: There was an error removing the thread from followed threads.
fi_fi: Tapahtui virhe poistettaessa lankaa seuratuista langoista.

source: Thread does not exist.
fi_fi: Lankaa ei ole olemassa.

source: There was an error adding the thread to followed threads.
fi_fi: Tapahtui virhe lisättäessä lankaa seurattuihin lankoihin.

source: Invalid username or password
fi_fi: Virheellinen käyttäjätunnus tai salasana

source: User account does not exist
fi_fi: Käyttäjätunnusta ei ole olemassa

source: This user account has been suspended
fi_fi: Tämä käyttäjätunnus on jäädytetty

source: Sent
fi_fi: Lähetetty

source: Deleted
fi_fi: Poistettu

source: No message received (Re-sending by refreshing the page does not work).
fi_fi: Viestiä ei vastaanotettu (Viestin uudelleenlähettäminen sivua päivittämällä ei toimi).

source: Invalid thread.
fi_fi: Virheellinen lanka.

source: This function requires you to have cookies enabled. Please allow cookies from your browser settings to continue.
fi_fi: Jotta voit käyttää tätä toimintoa, sinulla tulee olla evästeet sallittuna. Salli evästeet selaimesi asetukista jatkaaksesi.

source: This thread is locked, and cannot be replied to.
fi_fi: Tämä lanka on lukittu, eikä siihen voida vastata.

source: You are sending messages too fast. Please wait a while between your posts.
fi_fi: Lähetät viestejä liian nopeasti. Odota hetki niiden välillä.

source: Invalid board
fi_fi: Virheellinen lauta

source: Your message was not saved because this discussion board is locked.
fi_fi: Viestiäsi ei tallennettu, koska tämä lauta on lukittu.

source: Your post was not accepted because you fell into the honeypot meant for robots.
fi_fi: Viestiäsi ei otettu vastaan, koska lankesit roboteille tarkoitettuun hunajapurkkiin.

source: The internet connection you are using was recently used for abuse, so posting from it is temporarily not allowed.
fi_fi: Käyttämääsi internet-yhteyttä käytettiin äskettäin häiriköintiin, joten viestien lähettäminen sillä ei väliaikaisesti ole sallittua.

source: The internet connection you are using is commonly used for abuse, so posting from it is not allowed.
fi_fi: Käyttämääsi internet-yhteyttä käytetään usein häiriköintiin, joten viestien lähettäminen sillä ei ole sallittua.

source: Temporary spam protection enabled - you will need an user account older than %d hour(s) to post.
fi_fi: Väliaikainen spämmisuoja käytössä - tunnuksesi täytyy olla vanhempi kuin %d tunti(a) lähettääksesi viestejä.

source: Saving the file failed.
fi_fi: Tiedoston tallentaminen epäonnistui.

source: Your message has more newlines than anyone would need.
fi_fi: Viestisi sisältää enemmän rivinvaihtoja kuin kukaan tarvitsee.

source: A message is required to create a thread.
fi_fi: Langan luomiseen vaaditaan viesti.

source: To prevent spam, messages with more than %d replies are not allowed. You may remove this limit by purchasing a Gold account.
fi_fi: Roskapostituksen ehkäisemiseksi viestit joissa on yli %d vastausta eivät ole sallittuja. Voit poistaa tämän rajoituksen ostamalla Kultatilin.

source: Your message contained a blacklisted word. Posting blocked for %d minute(s).
fi_fi: Viestisi sisälsi mustalistatun sanan. Viestien lähettäminen on estetty %d minuutiksi.

source: A text or a file is required to send a message.
fi_fi: Teksti tai tiedosto vaaditaan viestin lähettämiseksi.

source: Your file is larger than the biggest allowed file size.
fi_fi: Tiedostosi on suurempi kuin suurin sallittu tiedostokoko.

source: The received file is empty, probably the file upload was interrupted. Please try again.
fi_fi: Vastaanotettu tiedosto on tyhjä, tiedoston lähetys ehkä keskeytyi. Yritä uudelleen.

source: Creating a file directory failed.
fi_fi: Tiedostohakemiston luominen epäonnistui.

source: File uploads are temporarily disabled. Please try again in a while.
fi_fi: Tiedostojen lähettäminen on tällä hetkellä pois käytöstä. Yritä uudelleen hetken kuluttua.

source: Your filename contained a blacklisted word
fi_fi: Tiedostonimesi sisälsi mustalistatun sanan

source: The type of the file you sent is not allowed.
fi_fi: Lähettämäsi tiedoston tyyppi ei ole sallittu.

source: Invalid file extension or corrupted file. The file extension is %s, but the detected file type was %s.
fi_fi: Virheellinen tiedostopääte tai korruptoitunut tiedosto. Tiedoston pääte on %s, mutta tunnistettu tiedostotyyppi oli %s.

source: An error occurred while saving the file. The file may be corrupted.
fi_fi: Tiedostoa tallennettaessa tapahtui virhe. Tiedosto saattaa olla korruptoitunut.

source: The dimensions of the image you uploaded are too big. Scale it down with an image editing software.
fi_fi: Lähettämäsi kuvan pikselimäärä on liian suuri. Pienennä sen kokoa kuvankäsittelyohjelmalla ennen lähettämistä.

source: The GIF you uploaded is too long. Please upload a video file instead.
fi_fi: Lähettämäsi GIF on liian pitkä. Lähetä videotiedosto sen sijasta.

source: An error occurred while saving the file.
fi_fi: Tiedostoa tallennettaessa tapahtui virhe.

source: An error occurred while saving the file. The file could be corrupted.
fi_fi: Tiedostoa tallennettaessa tapahtui virhe. Tiedosto voi olla korruptoitunut.

source: Cannot determine the duration or bitrate of the audio file you uploaded. The file may be corrupted.
fi_fi: Lähettämäsi äänitiedoston pituutta tai bittinopeutta ei voida määritellä. Tiedosto saattaa olla korruptoitunut.

source: Audio bitrate too low. This file cannot be saved.
fi_fi: Äänitiedoston bittinopeus on liian pieni. Tätä tiedostoa ei voida tallentaa.

source: The audio file you tried to upload is too long.
fi_fi: Lähettämäsi äänitiedosto on liian pitkä.

source: No streams found in the uploaded file. The file may be corrupted.
fi_fi: Lähetetystä tiedostosta ei löytynyt raitoja. Tiedosto saattaa olla korruptoitunut.

source: No video streams found in the uploaded file. The file may be corrupted.
fi_fi: Lähetetystä tiedostosta ei löytynyt videoraitoja. Tiedosto saattaa olla korruptoitunut.

source: Cannot determine the duration of the video you uploaded. The file may be corrupted.
fi_fi: Lähettämäsi videon pituutta ei voida määritellä. Tiedosto saattaa olla korruptoitunut.

source: The video you tried to upload is too long. Max length is %d minutes.
fi_fi: Lähettämäsi video on liian pitkä. Maksimipituus on %d minuuttia.

source: Generating the thumbnail failed. Please try again.
fi_fi: Esikatselukuvan luominen epäonnistui. Yritä uudelleen.

source: An error occurred while saving the file
fi_fi: Tiedostoa tallennettaessa tapahtui virhe

source: Creating the thread failed.
fi_fi: Langan luominen epäonnistui.
