Repository: Sopsy/Lauta1
Catalog: public/inc/i18n/*.UTF-8/LC_MESSAGES/default.po
Languages: fi_fi

source: Google reCAPTCHA is verifying that you are not a robot. Please wait...
fi_fi: Google reCAPTCHA varmistaa ettet ole robotti. Odota hetki...

source: Remove
fi_fi: Poista

source: Email address removed
fi_fi: Sähköpostiosoite poistettu

source: Reset password
fi_fi: Palauta salasana

source: Are you sure?
fi_fi: Oletko varma?

source: Loading...
fi_fi: Ladataan...

source: Cancel
fi_fi: Peruuta

source: Close media
fi_fi: Sulje media

source: Reply
fi_fi: Vastaa

source: Save
fi_fi: Tallenna

source: Saving...
fi_fi: Tallennetaan...

source: Close
fi_fi: Sulje

source: Notifications
fi_fi: Ilmoitukset

source: Mark all as read
fi_fi: Merkitse kaikki luetuksi

source: Your message might disappear if you leave this page.
fi_fi: Viestisi saattaa hävitä jos poistut tältä sivulta.

source: Loading timed out – please check your internet connection
fi_fi: Lataus aikakatkaistiin – tarkista internet-yhteytesi

source: Network error – please check that you are connected to the internet
fi_fi: Yhteysvirhe – tarkista että olet yhteydessä internetiin

source: Invalid data received. This is an internal error.
fi_fi: Virheellistä dataa vastaanotettu. Tämä on sisäinen virhe.

source: No data received. This is an internal error.
fi_fi: Dataa ei vastaanotettu. Tämä on sisäinen virhe.

source: User information changed
fi_fi: Käyttäjätunnuksen tiedot päivitetty

source: An error occurred
fi_fi: Tapahtui virhe

source: Copy
fi_fi: Kopioi

source: Copied to clipboard
fi_fi: Kopioitu leikepöydälle

source: Could not copy to clipboard
fi_fi: Leikepöydälle kopioiminen epäonnistui

source: Subject
fi_fi: Aihe

source: Delete thread
fi_fi: Poista lanka

source: Thread deleted
fi_fi: Lanka poistettu

source: Are you sure you want to delete this thread?
fi_fi: Haluatko varmasti poistaa tämän langan?

source: Delete the thread
fi_fi: Poista lanka

source: No new replies
fi_fi: Ei uusia vastauksia

source: This thread was deleted
fi_fi: Tämä lanka on poistettu

source: Thread AutoUpdater is not initialized. Please report this bug.
fi_fi: Lankojen AutoUpdater ei ole käynnistetty. Ilmoitathan tästä ongelmasta.

source: Loading new replies failed with an unknown error
fi_fi: Uusien viestien hakeminen epäonnistui tuntemattoman virheen vuoksi

source: Loading new replies failed, trying again...
fi_fi: Uusien viestien hakeminen epäonnistui, yritetään uudelleen...

source: Loading new posts automatically was stopped because there were no new posts for a long time
fi_fi: Uusien viestien hakeminen on pysäytetty, koska niitä ei ole tullut pitkään aikaan

source: Follow thread
fi_fi: Seuraa lankaa

source: Thread added to followed threads
fi_fi: Lanka lisätty seurattuihin lankoihin

source: Remove from followed threads
fi_fi: Poista seuratuista langoista

source: Thread removed from followed threads
fi_fi: Lanka poistettu seuratuista langoista

source: Are you sure you want to remove ALL of your followed threads on each board?
fi_fi: Haluatko varmasti poistaa kaikki seuratut lankasi?

source: Followed threads updated
fi_fi: Seuratut langat päivitetty

source: Hide thread
fi_fi: Piilota lanka

source: Restore thread
fi_fi: Palauta lanka

source: Activate this Gold account key?
fi_fi: Aktivoi tämä Kultatiliavain?

source: Invalid Gold account key
fi_fi: Virheellinen Kultatiliavain

source: Gold account activated!
fi_fi: Kultatili aktivoitu!

source: Do you really want to completely delete your user account? You will lose any Gold account time you have left! This operation cannot be undone.
fi_fi: Haluatko varmasti poistaa käyttäjätunnuksesi kokonaan? Menetät kaiken kultatiliajan, mitä sinulla on jäljellä! Tätä toimintoa ei voi peruuttaa.

source: User account deletion was not confirmed, account not deleted
fi_fi: Käyttäjätunnuksen poistoa ei vahvistettu, tunnusta ei poistettu

source: User account deleted
fi_fi: Käyttäjätunnus poistettu

source: Do you really want to delete the selected data? All of them will be deleted permanently and cannot be restored afterwards.
fi_fi: Haluatko varmasti poistaa valitut tiedot? Kaikki niistä poistetaan pysyvästi, eikä niitä voida enää jälkikäteen palauttaa.

source: Deletion cancelled, nothing deleted.
fi_fi: Poisto peruutettu, mitään ei poistettu.

source: Selected data is now permanently deleted.
fi_fi: Valitut tiedot ovat nyt pysyvästi poistettu.

source: Passwords do not match
fi_fi: Salasanat eivät täsmää

source: Please type in a password
fi_fi: Kirjoita salasana

source: Please type in a your current password
fi_fi: Kirjoita nykyinen salasanasi

source: This password is too weak
fi_fi: Tämä salasana on liian heikko

source: Password changed successfully
fi_fi: Salasana vaihdettu

source: Edit post
fi_fi: Muokkaa viestiä

source: Post edits
fi_fi: Viestin muokkaukset

source: Cancel editing? You will lose your changes.
fi_fi: Peruuta muokkaaminen? Menetät muutoksesi.

source: Cancel this post?
fi_fi: Peruuta tämä viesti?

source: Delete post
fi_fi: Poista viesti

source: Post deleted
fi_fi: Viesti poistettu

source: Are you sure you want to delete this post?
fi_fi: Haluatko varmasti poistaa tämän viestin?

source: Only delete the file
fi_fi: Poista vain tiedosto

source: Delete the post
fi_fi: Poista viesti

source: Post sent
fi_fi: Viesti lähetety

source: Sending...
fi_fi: Lähetetään...

source: Uploading file...
fi_fi: Lähetetään...

source: The file you have chosen exceeds the maximum file size limit of your user account
fi_fi: Valitsemasi tiedosto ylittää käyttäjätunnuksellesi sallitun tiedoston maksimikoon

source: Saving post...
fi_fi: Tallennetaan...

source: Replies
fi_fi: Vastaukset

source: Message
fi_fi: Viesti

source: Share post
fi_fi: Jaa viesti

source: OP
fi_fi: AP

source: You
fi_fi: Sinä

source: Link to this post
fi_fi: Linkki tähän viestiin

source: Your files exceed the maximum upload size.
fi_fi: Tiedostosi ylittävät suurimman sallitun tiedostokoon.

source: Your message will be sent after the file upload is completed.
fi_fi: Viestisi lähetetään tiedoston lähetyksen valmistuttua.

source: File deleted
fi_fi: Tiedosto poistettu

source: Number of posts
fi_fi: Viestien määrä

source: Hide post
fi_fi: Piilota viesti

source: Restore post
fi_fi: Palauta viesti

source: Report a rule violation
fi_fi: Ilmianna sääntörikkomus

source: Rule violation reported
fi_fi: Sääntörikkomus ilmiannettu

source: Donate a Gold account
fi_fi: Lahjoita Kultatili

source: Gold account donated!
fi_fi: Kultatili lahjoitettu!

source: Update your browser
fi_fi: Päivitä selaimesi

source: You are using an outdated browser. This site will not function properly with it.
fi_fi: Käytät vanhentunutta selainta. Tämä sivusto ei toimi oikein sen kanssa.

source: Please check for updates for your browser and operating system - or switch to Firefox or Chrome.
fi_fi: Tarkista selaimesi ja käyttöjärjestelmäsi päivitykset - tai vaihda Firefoxiin tai Chromeen.

source: 410 Gone
fi_fi: 410 Hävinnyt

source: 404 Not Found
fi_fi: 404 Ei Löydy

source: The thread has been deleted
fi_fi: Lanka on poistettu

source: The page or file you were looking for does not exist
fi_fi: Sivua tai tiedostoa jota etsit, ei ole olemassa

source: This thread has been deleted or it never even existed.
fi_fi: Tämä lanka on poistettu tai sitä ei koskaan ollutkaan.

source: Return to board
fi_fi: Palaa laudalle

source: You are banned.
fi_fi: Olet bannattu.

source: You were banned.
fi_fi: Olit bannattu.

source: Reason:
fi_fi: Syy:

source: Unknown
fi_fi: Tuntematon

source: Your post which resulted in this ban is the following
fi_fi: Viestisi joka johti tähän banniin on seuraava

source: Board: %s
fi_fi: Lauta: %s

source: No.
fi_fi: Nro.

source: Your post only contained a file, so it is not shown here.
fi_fi: Viestisi sisälsi vain tiedoston, joten sitä ei näytetä tässä.

source: Please read the rules of Ylilauta.
fi_fi: Luethan Ylilaudan säännöt.

source: Your ban is now over.
fi_fi: Bannisi on nyt ohi.

source: Your ban ends %s.
fi_fi: Bannisi päättyy %s.

source: Ban appeal
fi_fi: Muutoksenhaku banniin

source: We understand that people make mistakes. Us included. Please send us a message and we'll reconsider your ban.
fi_fi: Ymmärrämme, että ihmiset tekevät virheitä. Me mukaanluettuna. Lähetä meille viesti, niin voimme arvioida bannisi uudelleen.

source: Your message (max %s characters)
fi_fi: Viestisi (max %s merkkiä)

source: Note: We can not reply to your message. We can only approve or reject your appeal to lift this ban.
fi_fi: Huom: Emme voi vastata viestiisi. Voimme vain hyväksyä tai hylätä muutoksenhaun banniisi.

source: Submit
fi_fi: Lähetä

source: We have not yet reviewed the message you sent. Please check back later.
fi_fi: Emme ole vielä tarkistaneet lähettämääsi viestiä. Tarkista tilanne myöhemmin uudelleen.

source: Your message is:
fi_fi: Viestisi on:

source: After considering the message you sent, we are sorry to say that your ban was not lifted.
fi_fi: Tarkistimme lähettämäsi viestin, mutta valitettavasti banniasi ei peruttu.

source: Your message was:
fi_fi: Viestisi oli:

source: Banned!
fi_fi: Bannattu!

source: Sorry, there are no threads on this board.
fi_fi: Tällä laudalla ei ole lankoja.

source: Clear Custom CSS
fi_fi: Tyhjennä oma CSS

source: My threads
fi_fi: Omat langat

source: The threads you have made are shown on this page.
fi_fi: Tekemäsi langat näytetään tällä sivulla.

source: Replied threads
fi_fi: Vastatut langat

source: The threads you have replied to are shown on this page.
fi_fi: Langat joihin olet vastannut näytetään tällä sivulla.

source: Followed threads
fi_fi: Seuratut langat

source: The threads you are following are shown on this page.
fi_fi: Langat joita seuraat näytetään tällä sivulla.

source: All threads
fi_fi: Kaikki langat

source: Threads from all boards are shown on this page.
fi_fi: Langat kaikilta laudoilta näytetään tällä sivulla.

source: Hidden threads
fi_fi: Piilotetut langat

source: Threads you have hidden are shown on this page.
fi_fi: Piilottamasi langat näytetään tällä sivulla.

source: You have no threads here.
fi_fi: Sinulla ei ole lankoja täällä.

source: Gold account
fi_fi: Kultatili

source: Thread
fi_fi: Lanka

source: Gold
fi_fi: Kulta

source: Have a Gold account
fi_fi: Sinulla on Kultatili

source: Platinum
fi_fi: Platina

source: Have a permanent Gold account
fi_fi: Tunnuksellasi on ikuinen Kultatili

source: The King of Ylilauta
fi_fi: Ylilaudan kuningas

source: Have a maximum level platinum account
fi_fi: Tunnuksellasi on maksimitason platinatili

source: Bier
fi_fi: Kalia

source: Have spent a total of 10€ on any Ylilauta items to help the admins to relieve their work stresi wories
fi_fi: Olet käyttänyt yhteensä vähintään 10€ mihin tahansa Ylilaudan ostokseen auttaaksesi ylläpitäjiä poistamaan työ stresi huolia

source: Unique snowflake
fi_fi: Uniikki lumihiutale

source: Be a unique snowflake
fi_fi: Ole uniikki lumihiutale

source: Epic guy
fi_fi: Eeppinen kaveri

source: Epic threads give epic tags - have an archived thread
fi_fi: Eeppiset langat antavat eeppisiä tageja - tunnuksellasi on arkistoitu lanka

source: Adventburger
fi_fi: Adventtiburgeri

source: Get your thread to the advent calendar of Ylilauta
fi_fi: Saa lankasi Ylilaudan joulukalenteriin

source: Midsummer beer
fi_fi: Juhannusolut

source: Submit a post during midsummer
fi_fi: Lähetä viesti juhannuksena

source: Hyperactive
fi_fi: Hyperaktiivinen

source: Have at least 100 000 activity points
fi_fi: Tunnuksellasi on vähintään 100 000 aktiivisuuspistettä

source: Top commenter
fi_fi: Huippukommentoija

source: Your posts have received at least 1000 upboats
fi_fi: Viestisi ovat saaneet vähintään 1000 tää-ääntä

source: Upboated :D
fi_fi: Tää :D

source: Given at least 1000 upboats
fi_fi: Annettu vähintään 1000 tää-ääntä

source: Gold commenter
fi_fi: Kultakommentoija

source: You have received a Gold account from any of your posts
fi_fi: Olet saanut Kultatilin mistä tahansa viestistäsi

source: Goldboated :D
fi_fi: Kultatää :D

source: Donated a Gold account to another user
fi_fi: Lahjoita Kultatili toiselle käyttäjälle

source: YOLO-pro
fi_fi: YOLO-ammattilainen

source: Have achieved a YOLO-jackpot
fi_fi: Olet saanut YOLO-jackpotin

source: Assburger
fi_fi: Perspurilainen

source: You need to figure out how to find this
fi_fi: Sinun täytyy itse selvittää miten tämän saa

source: BTW I'm a grill
fi_fi: Olen muuten grilli

source: Anonymous is a leguan
fi_fi: Anonyymi on leguaani

source: There might be a few ways to obtain this - someday, somewhere...
fi_fi: Saattaa olla olemassa muutama tapa saada tämä - vielä joskus, vielä jossain...

source: Seal of Ylilauta
fi_fi: Ylisnorppa

source: You have done something good for Ylilauta, like reported a bug or given a good development idea
fi_fi: Olet tehnyt jotain hyvää Ylilaudalle, kuten esimerkiksi ilmoittanut bugista tai antanut hyvän kehitysidean

source: Ylilauta-pro
fi_fi: Ylilauta-ammattilainen

source: Have an user account older than a year
fi_fi: Tunnuksesi on vanhempi kuin vuoden

source: Always been here
fi_fi: Aina ollut täällä

source: Have an user account older than 3 years
fi_fi: Tunnuksesi on vanhempi kuin 3 vuotta

source: What the heck am I still doing here!?
fi_fi: Mitäs hemmettiä teen täällä vielä!?

source: Have an user account older than 6 years
fi_fi: Tunnuksesi on vanhempi kuin 6 vuotta

source: Took part in the markoboy87 -fundraiser (September 2014)
fi_fi: Ottanut osaa markoboy87 -keräykseen (syyskuu 2014)

source: Took part in the niilo22 -fundraiser (October 2015)
fi_fi: Ottanut osaa niilo22 -keräykseen (lokakuu 2015)

source: Took part in the niilo22 -fundraiser with a sum more than the average payment (October 2015)
fi_fi: Ottanut osaa niilo22 -keräykseen suuremmalla summalla kuin keskimääräinen maksu (lokakuu 2015)

source: Took part in the Ylis Roadtrip -fundraiser (August 2016)
fi_fi: Ottanut osaa Ylis Roadtrip -keräykseen (elokuu 2016)

source: Transporter with flames
fi_fi: Transporter liekeillä

source: Took part in the Ylis Roadtrip -fundraiser with a sum of 25€ or more (August 2016)
fi_fi: Ottanut osaa Ylis Roadtrip -keräykseen summalla 25 € tai enemmän (elokuu 2016)

source: Invalid
fi_fi: Invalidi

source: Took part in the Ylis gives back! -fundraiser (June 2017)
fi_fi: Ottanut osaa Ylis gives back! -keräykseen (kesäkuu 2017)

source: Honorary burger
fi_fi: Kunniaburger

source: Took part in the Ylis gives back! -fundraiser with a sum of more than the average (June 2017)
fi_fi: Ottanut osaa Ylis gives back! -keräykseen suuremmalla summalla kuin keskimääräinen maksu (kesäkuu 2017)

source: Help Helper
fi_fi: Apu Apustaja

source: Took part in the Food Help Helping -fundraiser (December 2018)
fi_fi: Ottanut osaa Ruoka Apu Apustus -keräykseen (joulukuu 2018)

source: Good Apulitan
fi_fi: Laupias Apulialainen

source: Took part in the Food Help Helping -fundraiser with a sum of more than the average (December 2018)
fi_fi: Ottanut osaa Ruoka Apu Apustus -keräykseen suuremmalla summalla kuin keskimääräinen maksu (joulukuu 2018)

source: Macaroni
fi_fi: Makaroni

source: All of my money went to Hursti, now I will have to eat macaroni
fi_fi: Kaikki rahat meni Hurstille, nyt täytyy syödä makaronia

source: Coronavirus
fi_fi: Koronavirus

source: Got infected by a virtual coronavirus
fi_fi: Sait virtuaalisen koronavirustartunnan

source: Christmasburger
fi_fi: Jouluburgeri

source: Purchased a Gold account during december of 2015
fi_fi: Ostanut Kultatilin joulukuussa 2015

source: Finland 100 years
fi_fi: Suomi 100 vuotta

source: Purchased a Gold account on Finland's 100th independence day
fi_fi: Ostanut Kultatilin Suomen sadantena itsenäisyyspäivänä

source: Mass storage massacre
fi_fi: Kovokausti

source: Lived to tell the tales of the great Mass storage massacre (June 2017)
fi_fi: Elit suuren Kovokaustin yli (kesäkuu 2017)

source: Go back
fi_fi: Palaa takaisin

source: Error:
fi_fi: Virhe:

source: Protected by reCAPTCHA (%sPrivacy%s - %sTerms%s)
fi_fi: ReCAPTCHAn suojaama (%sTietosuoja%s - %sEhdot%s)

source: You don't have any followed threads.
fi_fi: Sinulla ei ole seurattuja lankoja.

source: Clear all
fi_fi: Tyhjennä kaikki

source: Hide
fi_fi: Piilota

source: Update
fi_fi: Päivitä

source: Username
fi_fi: Käyttäjätunnus

source: Password
fi_fi: Salasana

source: Create account
fi_fi: Luo tunnus

source: Log in
fi_fi: Kirjaudu

source: Forgot password?
fi_fi: Unohtuiko salasana?

source: At least %d characters
fi_fi: Vähintään %d merkkiä

source: Password confirmation
fi_fi: Salasanavahvistus

source: Email (optional)
fi_fi: Sähköposti (valinnainen)

source: Create
fi_fi: Luo

source: Logged in as %s
fi_fi: Kirjautuneena: %s

source: Preferences
fi_fi: Asetukset

source: Management
fi_fi: Hallinta

source: Log out
fi_fi: Kirjaudu ulos

source: Activity points
fi_fi: Aktiivisuuspisteet

source: 1 report
fi_fi: 1 ilmianto

source: %s reports
fi_fi: %s ilmiantoa

source: 1 ban appeal
fi_fi: 1 bannivalitus

source: %s ban appeals
fi_fi: %s bannivalitusta

source: Boards
fi_fi: Laudat

source: readers
fi_fi: lukijaa

source: reader
fi_fi: lukija

source: Go to bottom
fi_fi: Siirry alareunaan

source: Back to top
fi_fi: Takaisin ylös

source: Preferences and profile
fi_fi: Asetukset ja profiili

source: Refresh page
fi_fi: Päivitä sivu

source: Temporary spam protection active: You will need to wait %d hour(s) or login to an older user account to post.
fi_fi: Väliaikainen roskapostisuoja on aktiivisena: Sinun on odotettava %d tunti(a) tai kirjauduttava vanhemmalle käyttäjätilille lähettääksesi viestejä.

source: Click for more info...
fi_fi: Klikkaa tästä saadaksesi lisätietoja...

source: Create thread
fi_fi: Luo lanka

source: Subject (optional)
fi_fi: Aihe (valinnainen)

source: Board
fi_fi: Lauta

source: Choose board
fi_fi: Valitse lauta

source: File
fi_fi: Tiedosto

source: Options
fi_fi: Valinnat

source: Post settings
fi_fi: Viestin asetukset

source: Don't bump the thread
fi_fi: Älä nosta lankaa

source: Show username
fi_fi: Näytä käyttäjänimi

source: Show filename
fi_fi: Näytä tiedostonimi

source: Gold account functions
fi_fi: Kultatilitoiminnot

source: Make post visible only with a Gold account
fi_fi: Näytä viesti vain Kultatililäisille

source: Moderator functions
fi_fi: Moderaattoritoiminnot

source: (for new threads)
fi_fi: (uusille langoille)

source: Lock thread
fi_fi: Lukitse lanka

source: Stick thread
fi_fi: Kiinnitä lanka

source: Show admin-tag
fi_fi: Näytä ylläpitotagi

source: Tags
fi_fi: Tagit

source: You don't have any tags
fi_fi: Sinulla ei ole tageja

source: How to get tags?
fi_fi: Miten saan tageja?

source: Reply to thread
fi_fi: Vastaa lankaan

source: Next
fi_fi: Seuraava

source: Remove from followed
fi_fi: Poista seuratuista

source: Manage thread
fi_fi: Hallitse lankaa

source: Original post deleted
fi_fi: Aloitusviesti poistettu

source: No replies
fi_fi: Ei vastauksia

source: One reply
fi_fi: Yksi vastaus

source: %d replies
fi_fi: %d vastausta

source: from a single user
fi_fi: yhdeltä käyttäjältä

source: from %d users
fi_fi: %d käyttäjältä

source: opened once
fi_fi: avattu kerran

source: opened %d times
fi_fi: avattu %d kertaa

source: one follower
fi_fi: yksi seuraaja

source: %d followers
fi_fi: %d seuraajaa

source: hidden by one user
fi_fi: yksi käyttäjä piilottanut

source: hidden by %d users
fi_fi: %d käyttäjää piilottanut

source: Show earlier replies
fi_fi: Näytä aiemmat vastaukset

source: Hide earlier replies
fi_fi: Piilota aiemmat vastaukset

source: Open
fi_fi: Avaa

source: Report message
fi_fi: Ilmianna viesti

source: Ban user
fi_fi: Bannaa käyttäjä

source: Share
fi_fi: Jaa

source: This message is only visible to users with a Gold account.
fi_fi: Tämä viesti näkyy vain käyttäjille, joilla on Kultatili.

source: Administration
fi_fi: Ylläpito

source: Show edit history
fi_fi: Näytä muokkaushistoria

source: edited
fi_fi: muokattu

source: Upboat
fi_fi: Tää :D

source: Donate gold
fi_fi: Lahjoita kultatili

source: Edit message
fi_fi: Muokkaa viestiä

source: Delete message
fi_fi: Poista viesti

source: Bulletin board
fi_fi: Ilmoitustaulu

source: Reported posts
fi_fi: Ilmiannetut viestit

source: Ban appeals
fi_fi: Bannivalitukset

source: Ban a user
fi_fi: Bannaa käyttäjä

source: Manage bans
fi_fi: Hallitse banneja

source: Moderator list
fi_fi: Moderaattorilista

source: Moderation log
fi_fi: Moderointiloki

source: Message amounts
fi_fi: Viestimäärät

source: Manage Gold accounts
fi_fi: Kultatilihallinta

source: Manage boards
fi_fi: Hallitse lautoja

source: Blacklisted words
fi_fi: Mustalistatut sanat

source: File search
fi_fi: Tiedostohaku

source: Deleted posts
fi_fi: Poistetut viestit

source: Delete a thread or a post
fi_fi: Poista lanka tai viesti

source: Update thread options
fi_fi: Päivitä langan tietoja

source: Post stream
fi_fi: Viestisyöte

source: Search multiple posts
fi_fi: Etsi useita viestejä

source: Search user posts
fi_fi: Etsi käyttäjän viestit

source: New users
fi_fi: Uudet käyttäjät

source: Other reason
fi_fi: Jokin muu syy

source: Illegal or dangerous content
fi_fi: Laiton tai vaarallinen sisältö

source: Illegal or dangerous content (extreme violence)
fi_fi: Laiton tai vaarallinen sisältö (raaka väkivalta)

source: Illegal or dangerous content (sexual material of children)
fi_fi: Laiton tai vaarallinen sisältö (lasten seksualisointi)

source: Illegal or dangerous content (selling/buying drugs)
fi_fi: Laiton tai vaarallinen sisältö (huumeiden osto/myynti)

source: Spam
fi_fi: Roskapostitus

source: Spam (repetitive or duplicate content)
fi_fi: Roskapostitus (toistuva tai duplikaatti sisältö)

source: Spam (post solely intended to bump a thread)
fi_fi: Roskapostitus (viesti jonka ainoa tarkoitus on nostaa lankaa)

source: Spam (anime)
fi_fi: Roskapostitus (anime)

source: Spam (telling others that you reported a post)
fi_fi: Roskapostitus (viestin ilmiantamisesta ilmoittaminen muille)

source: Malicious content
fi_fi: Haitallinen sisältö

source: Malicious content (link shorteners)
fi_fi: Haitallinen sisältö (linkinlyhentimet)

source: Advertising
fi_fi: Mainostaminen

source: Harassment
fi_fi: Häiriköinti

source: Sexually explicit content
fi_fi: Seksuaalinen sisältö

source: Inappropriate content
fi_fi: Sopimaton sisältö

source: Your message contained a blacklisted word
fi_fi: Viestisi sisälsi mustalistatun sanan

source: day
fi_fi: päivä

source: week
fi_fi: viikko

source: month
fi_fi: kuukausi

source: months
fi_fi: kuukautta

source: year
fi_fi: vuosi

source: years
fi_fi: vuotta

source: seconds
fi_fi: sekuntia

source: This key has already been used.
fi_fi: Tämä avain on jo käytetty.

source: You already have a platinum account, you cannot activate Gold account keys.
fi_fi: Sinulla on jo platinatili, joten et voi aktivoida Kultatiliavaimia.

source: Exists
fi_fi: Asetettu

source: Not set
fi_fi: Ei asetettu

source: %s sent messages already!
fi_fi: jo %s lähetettyä viestiä!

source: %s users online
fi_fi: %s käyttäjää paikalla

source: %s messages during the last hour
fi_fi: %s viestiä viimeisen tunnin aikana

source: Popular threads right now
fi_fi: Suositut langat juuri nyt

source: Popular threads today
fi_fi: Suositut langat tänään

source: Post %d does not exist
fi_fi: Viestiä %d ei ole olemassa

source: Post ID
fi_fi: Viestin ID

source: Delete all posts by the user in the last 24h
fi_fi: Poista kaikki käyttäjän viestit viimeisen vuorokauden ajalta

source: Delete all threads by the user in the last 24h
fi_fi: Poista kaikki käyttäjän langat viimeisen vuorokauden ajalta

source: Ban user account
fi_fi: Bannaa käyttäjätunnus

source: Ban IP-address
fi_fi: Bannaa IP-osoite

source: Reason and length
fi_fi: Syy ja pituus

source: Choose reason
fi_fi: Valitse syy

source: Additional info (optional)
fi_fi: Lisätiedot (vapaaehtoinen)

source: Ban length in seconds
fi_fi: Bannin pituus sekunneissa

source: User (ID)
fi_fi: Käyttäjä (ID)
